// JSON  არის მონაცემთა გაცვლის ფორმატი
// იგი გამოიყენება მონაცემების გადაცემისთვის კლიენტსა და სერვერს შორის

// JSON სტრუქტურა ძალიან ჰგავს JavaScript-ის ობიექტებს,
// რაც ამარტივებს მასთან მუშაობას JavaScript-ში

// JSON გვაძლევს საშუალებას, წავშალოთ ან გადავცეთ სტრუქტურირებული მონაცემები,
// როგორიცაა მასივები და ობიექტები

// მაგალითად, API-დან მონაცემების წამოღება ძირითადად ხდება JSON ფორმატში



//-----------------------------------------------2
// {
//   "სახელი": "ანა",
//   "ასაკი": 25,
//   "ჰობი": ["კითხვის", "ცურვა"]
// }



// fetch("https://api.example.com/data")
//   .then(response => response.json())
//   .then(data => console.log(data));












//-----------------------------------------------3

//json
// {
//   "user": "giorgi",
//   "age": 30,
//   "skills": ["HTML", "CSS", "JavaScript"]
// }

//js
// const data = {
//   user: "giorgi",
//   age: 30,
//   skills: ["HTML", "CSS", "JavaScript"]
// };


fetch("ragaca")
  .then(res => res.json()) // json ტექსტი გადაკეთდება js ობიექტად
  .then(data => {
    console.log(data); // უკვე გვაქვს ობიექტი ან მასივი
  });
